resources/xmlfiles/taxlink/ap-taxonlyinvoice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.vertexinc.com/vertextl/taxIntegration/types/">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:MessageID>uuid:fc36c536-9d39-41c2-8fb3-20758ed0691b</wsa:MessageID>
		<wsa:Action>calculation</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<typ:calculation>
			<typ:trxHeader>
				<typ:ApplicationId>200</typ:ApplicationId>
				<typ:ApplicationShortname>AP</typ:ApplicationShortname>
				<typ:DefaultTaxationCountry>US</typ:DefaultTaxationCountry>
				<typ:DocEventStatus>UPDATED</typ:DocEventStatus>
				<typ:EntityCode>AP_INVOICES</typ:EntityCode>
				<typ:EventClassCode>STANDARD INVOICES</typ:EventClassCode>
				<typ:EventTypeCode>STANDARD UPDATED</typ:EventTypeCode>
				<typ:EndPointUrl>https://ecog-test.fa.us2.oraclecloud.com</typ:EndPointUrl>
				<typ:FirstPtyOrgId>300000004221936</typ:FirstPtyOrgId>
				<typ:FirstPtyRegId>300000018810124</typ:FirstPtyRegId>
				<typ:FirstPtyRegNumber>987654321</typ:FirstPtyRegNumber>
				<typ:HdrTrxUserKey1>CALCULATE</typ:HdrTrxUserKey1>
				<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
				<typ:LedgerId>300000001139008</typ:LedgerId>
				<typ:LegalEntityId>300000001140053</typ:LegalEntityId>
				<typ:LegalEntityNumber>RIUS104111</typ:LegalEntityNumber>
				<typ:LogLevel>SEVERE</typ:LogLevel>
				<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
				<typ:TrxDate>2022-09-16</typ:TrxDate>
				<typ:TrxHeaderAmt>100</typ:TrxHeaderAmt>
				<typ:TrxId>740622</typ:TrxId>
				<typ:TrxNumber>AUTOTST_APTAXONLYINVOICE_87086</typ:TrxNumber>
			</typ:trxHeader>
			<typ:trxLineList>
				<typ:trxLine>
					<typ:ApplicationId>200</typ:ApplicationId>
					<typ:BillFromGeographyType1>ADDRESS1</typ:BillFromGeographyType1>
					<typ:BillFromGeographyType10>PROVINCE</typ:BillFromGeographyType10>
					<typ:BillFromGeographyType2>ADDRESS2</typ:BillFromGeographyType2>
					<typ:BillFromGeographyType3>ADDRESS3</typ:BillFromGeographyType3>
					<typ:BillFromGeographyType4>ADDRESS4</typ:BillFromGeographyType4>
					<typ:BillFromGeographyType5>COUNTRY</typ:BillFromGeographyType5>
					<typ:BillFromGeographyType6>STATE</typ:BillFromGeographyType6>
					<typ:BillFromGeographyType7>COUNTY</typ:BillFromGeographyType7>
					<typ:BillFromGeographyType8>CITY</typ:BillFromGeographyType8>
					<typ:BillFromGeographyType9>POSTALCODE</typ:BillFromGeographyType9>
					<typ:BillFromGeographyValue1>5600 Independence Ave</typ:BillFromGeographyValue1>
					<typ:BillFromGeographyValue2>Suite 100</typ:BillFromGeographyValue2>
					<typ:BillFromGeographyValue5>US</typ:BillFromGeographyValue5>
					<typ:BillFromGeographyValue6>California</typ:BillFromGeographyValue6>
					<typ:BillFromGeographyValue7>Fresno</typ:BillFromGeographyValue7>
					<typ:BillFromGeographyValue8>Fresno</typ:BillFromGeographyValue8>
					<typ:BillFromGeographyValue9>93650</typ:BillFromGeographyValue9>
					<typ:BillFromLocationId>300000004277754</typ:BillFromLocationId>
					<typ:BillThirdPtyAcctId>300000004277749</typ:BillThirdPtyAcctId>
					<typ:BillThirdPtyAcctSiteId>300000004277762</typ:BillThirdPtyAcctSiteId>
					<typ:BillToGeographyType1>ADDRESS1</typ:BillToGeographyType1>
					<typ:BillToGeographyType10>PROVINCE</typ:BillToGeographyType10>
					<typ:BillToGeographyType2>ADDRESS2</typ:BillToGeographyType2>
					<typ:BillToGeographyType3>ADDRESS3</typ:BillToGeographyType3>
					<typ:BillToGeographyType4>ADDRESS4</typ:BillToGeographyType4>
					<typ:BillToGeographyType5>COUNTRY</typ:BillToGeographyType5>
					<typ:BillToGeographyType6>STATE</typ:BillToGeographyType6>
					<typ:BillToGeographyType7>COUNTY</typ:BillToGeographyType7>
					<typ:BillToGeographyType8>CITY</typ:BillToGeographyType8>
					<typ:BillToGeographyType9>POSTALCODE</typ:BillToGeographyType9>
					<typ:BillToGeographyValue1>5430 One Shields Avenue</typ:BillToGeographyValue1>
					<typ:BillToGeographyValue5>US</typ:BillToGeographyValue5>
					<typ:BillToGeographyValue6>Pennsylvania</typ:BillToGeographyValue6>
					<typ:BillToGeographyValue8>Berwyn</typ:BillToGeographyValue8>
					<typ:BillToGeographyValue9>19312</typ:BillToGeographyValue9>
					<typ:BillToLocationId>300000001141673</typ:BillToLocationId>
					<typ:EntityCode>AP_INVOICES</typ:EntityCode>
					<typ:EventClassCode>STANDARD INVOICES</typ:EventClassCode>
					<typ:LineAmt>100</typ:LineAmt>
					<typ:LineAmtIncludesTaxFlag>N</typ:LineAmtIncludesTaxFlag>
					<typ:LineClass>STANDARD INVOICES</typ:LineClass>
					<typ:LineLevelAction>LINE_INFO_TAX_ONLY</typ:LineLevelAction>
					<typ:LinesDetFactorId>300000029086663</typ:LinesDetFactorId>
					<typ:MinimumAccountableUnit>0.01</typ:MinimumAccountableUnit>
					<typ:Precision>2</typ:Precision>
					<typ:PseudoTrxLineFlag>Y</typ:PseudoTrxLineFlag>
					<typ:ShipFromGeographyType1>ADDRESS1</typ:ShipFromGeographyType1>
					<typ:ShipFromGeographyType10>PROVINCE</typ:ShipFromGeographyType10>
					<typ:ShipFromGeographyType2>ADDRESS2</typ:ShipFromGeographyType2>
					<typ:ShipFromGeographyType3>ADDRESS3</typ:ShipFromGeographyType3>
					<typ:ShipFromGeographyType4>ADDRESS4</typ:ShipFromGeographyType4>
					<typ:ShipFromGeographyType5>COUNTRY</typ:ShipFromGeographyType5>
					<typ:ShipFromGeographyType6>STATE</typ:ShipFromGeographyType6>
					<typ:ShipFromGeographyType7>COUNTY</typ:ShipFromGeographyType7>
					<typ:ShipFromGeographyType8>CITY</typ:ShipFromGeographyType8>
					<typ:ShipFromGeographyType9>POSTALCODE</typ:ShipFromGeographyType9>
					<typ:ShipFromGeographyValue1>5600 Independence Ave</typ:ShipFromGeographyValue1>
					<typ:ShipFromGeographyValue2>Suite 100</typ:ShipFromGeographyValue2>
					<typ:ShipFromGeographyValue5>US</typ:ShipFromGeographyValue5>
					<typ:ShipFromGeographyValue6>California</typ:ShipFromGeographyValue6>
					<typ:ShipFromGeographyValue7>Fresno</typ:ShipFromGeographyValue7>
					<typ:ShipFromGeographyValue8>Fresno</typ:ShipFromGeographyValue8>
					<typ:ShipFromGeographyValue9>93650</typ:ShipFromGeographyValue9>
					<typ:ShipFromLocationId>300000004277754</typ:ShipFromLocationId>
					<typ:ShipThirdPtyAcctId>300000004277749</typ:ShipThirdPtyAcctId>
					<typ:ShipThirdPtyAcctSiteId>300000004277762</typ:ShipThirdPtyAcctSiteId>
					<typ:ShipToGeographyType1>ADDRESS1</typ:ShipToGeographyType1>
					<typ:ShipToGeographyType10>PROVINCE</typ:ShipToGeographyType10>
					<typ:ShipToGeographyType2>ADDRESS2</typ:ShipToGeographyType2>
					<typ:ShipToGeographyType3>ADDRESS3</typ:ShipToGeographyType3>
					<typ:ShipToGeographyType4>ADDRESS4</typ:ShipToGeographyType4>
					<typ:ShipToGeographyType5>COUNTRY</typ:ShipToGeographyType5>
					<typ:ShipToGeographyType6>STATE</typ:ShipToGeographyType6>
					<typ:ShipToGeographyType7>COUNTY</typ:ShipToGeographyType7>
					<typ:ShipToGeographyType8>CITY</typ:ShipToGeographyType8>
					<typ:ShipToGeographyType9>POSTALCODE</typ:ShipToGeographyType9>
					<typ:ShipToGeographyValue1>5430 One Shields Avenue</typ:ShipToGeographyValue1>
					<typ:ShipToGeographyValue5>US</typ:ShipToGeographyValue5>
					<typ:ShipToGeographyValue6>Pennsylvania</typ:ShipToGeographyValue6>
					<typ:ShipToGeographyValue8>Berwyn</typ:ShipToGeographyValue8>
					<typ:ShipToGeographyValue9>19312</typ:ShipToGeographyValue9>
					<typ:ShipToLocationId>300000001141673</typ:ShipToLocationId>
					<typ:TaxReportingFlag>Y</typ:TaxReportingFlag>
					<typ:TrxId>740622</typ:TrxId>
					<typ:TrxLineId>1</typ:TrxLineId>
					<typ:TrxLineNumber>1</typ:TrxLineNumber>
					<typ:TrxLevelType>LINE</typ:TrxLevelType>
					<typ:VendorTypeLookupCode>SUPPLIER</typ:VendorTypeLookupCode>
					<typ:VendorNumber>10021</typ:VendorNumber>
				</typ:trxLine>
			</typ:trxLineList>
			<typ:trxDetailTaxLineList>
				<typ:trxDetailTaxLine>
					<typ:ApplicationId>200</typ:ApplicationId>
					<typ:CancelFlag>N</typ:CancelFlag>
					<typ:CompoundingTaxFlag>N</typ:CompoundingTaxFlag>
					<typ:CopiedFromOtherDocFlag>N</typ:CopiedFromOtherDocFlag>
					<typ:DeleteFlag>N</typ:DeleteFlag>
					<typ:EntityCode>AP_INVOICES</typ:EntityCode>
					<typ:EventClassCode>STANDARD INVOICES</typ:EventClassCode>
					<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
					<typ:LedgerId>300000001139008</typ:LedgerId>
					<typ:LegalEntityId>300000001140053</typ:LegalEntityId>
					<typ:LegalReportingStatus>000000000000000</typ:LegalReportingStatus>
					<typ:LineAmt>100</typ:LineAmt>
					<typ:ManuallyEnteredFlag>Y</typ:ManuallyEnteredFlag>
					<typ:MinimumAccountableUnit>0.01</typ:MinimumAccountableUnit>
					<typ:OffsetFlag>N</typ:OffsetFlag>
					<typ:OverriddenFlag>Y</typ:OverriddenFlag>
					<typ:Precision>2</typ:Precision>
					<typ:ReportableFlag>Y</typ:ReportableFlag>
					<typ:ReportingOnlyFlag>N</typ:ReportingOnlyFlag>
					<typ:RoundingLevelCode>HEADER</typ:RoundingLevelCode>
					<typ:RoundingRuleCode>NEAREST</typ:RoundingRuleCode>
					<typ:SelfAssessedFlag>N</typ:SelfAssessedFlag>
					<typ:Tax>STATE</typ:Tax>
					<typ:TaxAmt>100</typ:TaxAmt>
					<typ:TaxAmtIncludedFlag>N</typ:TaxAmtIncludedFlag>
					<typ:TaxAmtTaxCurr>100</typ:TaxAmtTaxCurr>
					<typ:TaxApportionmentLineNumber>1</typ:TaxApportionmentLineNumber>
					<typ:TaxCurrencyCode>USD</typ:TaxCurrencyCode>
					<typ:TaxCurrencyConversionDate>2022-05-11</typ:TaxCurrencyConversionDate>
					<typ:TaxCurrencyConversionRate>1</typ:TaxCurrencyConversionRate>
					<typ:TaxDate>2022-05-11</typ:TaxDate>
					<typ:TaxDetermineDate>2022-05-11</typ:TaxDetermineDate>
					<typ:TaxJurisdictionCode>ST-VTL-130000000</typ:TaxJurisdictionCode>
					<typ:TaxLineId>300000029086664</typ:TaxLineId>
					<typ:TaxLineNumber>1</typ:TaxLineNumber>
					<typ:TaxOnlyLineFlag>Y</typ:TaxOnlyLineFlag>
					<typ:TaxPointBasis>INVOICE</typ:TaxPointBasis>
					<typ:TaxRate>6</typ:TaxRate>
					<typ:TaxRateCode>STD</typ:TaxRateCode>
					<typ:TaxRateType>PERCENTAGE</typ:TaxRateType>
					<typ:TaxRegimeCode>VERTEX US TAX</typ:TaxRegimeCode>
					<typ:TaxStatusCode>STANDARD</typ:TaxStatusCode>
					<typ:TaxableAmt>1666.67</typ:TaxableAmt>
					<typ:TaxableAmtTaxCurr>1666.67</typ:TaxableAmtTaxCurr>
					<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
					<typ:TrxDate>2022-09-16</typ:TrxDate>
					<typ:TrxId>740622</typ:TrxId>
					<typ:TrxLevelType>LINE</typ:TrxLevelType>
					<typ:TrxLineId>1</typ:TrxLineId>
					<typ:UnroundedTaxAmt>100</typ:UnroundedTaxAmt>
					<typ:UnroundedTaxableAmt>1666.66666666666666666667</typ:UnroundedTaxableAmt>
				</typ:trxDetailTaxLine>
			</typ:trxDetailTaxLineList>
		</typ:calculation>
	</soapenv:Body>
</soapenv:Envelope>